//문제
//구름 EDU의 강사인 구름이는 시간복잡도에 대한 강의를 맡게 되었다. 시간복잡도에는 여러 가지가 있는데, 한 번의 산술 연산에 걸리는 상수 시간인 O(1), 이분 탐색에 걸리는 로그 시간인 O(log N), 정렬되지 않은 배열에서 특정한 수를 찾을 때 걸리는 선형 시간인 O(N),
//병합 정렬에 걸리는 선형 로그 시간인 O(N log N), 버블 정렬에 걸리는 2차 시간인 O(N^2), N개의 비트에서 나올 수 있는 경우를 모두 구할 때 걸리는 지수 시간인 O(2^N) 등이 있다. 그리고 주어진 배열의 모든 순열을 구하는 계승 시간인 O(N!)도 있다.
//O(N!)은 N이 20만 되어도 243경 정도가 될 정도로 정말 빨리 커진다. 그래서 구름이는 O(N!)이 얼마나 빨리 커지는지 수강생들에게 알려주기 위해, 임의의 N에 따라 N!의 맨 뒤에 붙는 연속된 0의 개수를 구하는 프로그램을 작성하려고 한다.
//
//N이 주어질 때, N!의 맨 뒤에 붙는 연속된 0의 개수를 알아보자.
//
//입력
//첫째 줄에 정수 N이 주어진다.
//
//출력
//N! 의 맨 뒤에 붙는 연속된 0의 개수를 출력한다.
//
//예시 1
//입력
//1
//출력
//0
//
//예시 2
//입력
//10
//출력
//2
//
//예시 3
//입력
//1000000000
//출력
//249999998

// 5의 배수, 25의 배수, 125의 배수 개수를 찾으면 된다. 2는 뒤에 반드시 따라오기 때문.

import java.io.*;
class Main {
    public static void main(String[] args) throws Exception {
        BufferedReader br = new BufferedReader(new InputStreamReader(System.in));

        long N = Long.parseLong(br.readLine());
        long count = 0;

        // 5의 배수 개수 세기
        for(long i = 5; i <= N; i*=5) {
            count += N/i;
        }

        System.out.println(count);
    }
}